## **Data Cleaning And Formatting With Python:**

### **Import Important Libraries And Modules:**

In [1]:
import pandas as pd
import numpy as np
import ast

### **Export The CSV File Of The Dataset:**

In [2]:
df = pd.read_csv('D:\\IT Courses\\Finished Courses\\LinkedIn Job Market Analysis Project\\LinkedIn_Data_Job_Market_Analysis_Project\\Dataset\\clean_jobs.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 327 entries, 0 to 326
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               327 non-null    int64
 1   title            327 non-null    object
 2   company          327 non-null    object
 3   location         327 non-null    object
 4   link             327 non-null    object
 5   source           327 non-null    object
 6   date_posted      327 non-null    object
 7   work_type        0 non-null      float64
 8   employment_type  0 non-null      float64
 9   description      327 non-null    object
dtypes: float64(2), int64(1), object(7)
memory usage: 25.7+ KB

In [4]:
df_copy = df.copy()

### **Data Cleaning & Formatting:**

**1. Remove Nan Values Columns & "link" Column:**

In [ ]:
df_copy = df_copy.drop(
    ['work_type', 'employment_type', 'link'],
    axis=1
)

**2. Change Data Type Of Column "date_posted" To Datatime Data Type:**

In [7]:
df_copy['date_posted'] = pd.to_datetime(df_copy['date_posted'])

**3. Remove Duplicated Rows:**

**3.1. Explore Number Of Duplicated Rows With Same Columns Values:**

In [8]:
int(df_copy.duplicated().sum()) # 0

0

**3.2. Explore If There Duplicated Row With Same Values Of (Title - Company - Location)**

In [9]:
duplocated_rows = df_copy[df_copy.duplicated(['title', 'company', 'location'], keep=False)].sort_values(by=['title', 'company', 'location'], ascending=True)

In [10]:
len(duplocated_rows)

39

In [11]:
duplocated_rows.head(6)

,id,title,company,location,source,date_posted,description
67,111,Data Analyst,Explore Group,"London Area, United Kingdom",LinkedIn,2025-04-15,Data Analyst\n\n***MUST HAVE MARITIME EXPERIEN...
79,128,Data Analyst,Explore Group,"London Area, United Kingdom",LinkedIn,2025-04-16,Senior Data Analyst – Maritime Industry Focus ...
66,110,Data Analyst,PT Indofood CBP Sukses Makmur Tbk - Noodle Div...,"Jakarta, Jakarta, Indonesia",LinkedIn,2025-04-16,Persyaratan Pekerjaan\n\n\nHave advance skills...
68,112,Data Analyst,PT Indofood CBP Sukses Makmur Tbk - Noodle Div...,"Jakarta, Jakarta, Indonesia",LinkedIn,2025-04-16,Persyaratan Pekerjaan\n\n\nMemiliki gelar sarj...
290,653,Data Engineer,Thomson Reuters,"Bengaluru, Karnataka, India",LinkedIn,2025-04-11,Job Description:\nDevelop/enhance data warehou...
291,654,Data Engineer,Thomson Reuters,"Bengaluru, Karnataka, India",LinkedIn,2025-04-11,Job Description:\nDevelop/enhance data warehou...

**We identified duplicate job postings with matching titles, companies, and locations but varying descriptions. This likely indicates either:**

**1. The same job listed across multiple LinkedIn sections (e.g., search results and recommendations).**

**2. Updated versions of the original posting with modified descriptions.**

**So, we will remove this duplicated rows.**

In [12]:
df_copy = df_copy.drop(duplocated_rows.index)

In [13]:
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
Index: 288 entries, 0 to 326
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           288 non-null    int64
 1   title        288 non-null    object
 2   company      288 non-null    object
 3   location     288 non-null    object
 4   source       288 non-null    object
 5   date_posted  288 non-null    datetime64[ns]
 6   description  288 non-null    object
dtypes: datetime64[ns](1), int64(1), object(5)
memory usage: 18.0+ KB

**4.  Create Column "job_title_short" From Column "title" For General Data Jobs Titles Classification In Analysis:**

In [14]:
df_copy['title'].nunique()

148

In [15]:
df_copy['title'].unique()

array(['Data Analyst', 'Data Analyst II',
       'Data Analyst, Production Finance Operations & Innovation',
       'Data Analyst - Marketing',
       'Data Analyst, Global Partnerships & Content',
       'Senior Data Analyst', 'Data Products Analyst, YouTube',
       'Customer Relationship Management Analyst',
       'Data Analyst - SQL, ERP', 'Marketing Data Analyst',
       'Analytics Associate', 'Data Analyst I',
       'Data & Analytics, Analyst', 'Junior Data Analyst - Remote',
       'People Data Analyst', 'Customer Insights Analyst',
       'Data Analyst Intern (Fall start)', 'Analyst, Data Science, RMBS',
       'Analyst', 'Business Data Analyst', 'Junior Data Analyst',
       'Healthcare Data Analyst I - Remote', 'Data Analyst - 100% Remote',
       'Insights Analyst', 'Sr. Data Analyst', 'Data Analyst Contractor',
       'Analyst, Data Analytics & Intelligence',
       'Analista de Dados Junior - São Paulo/SP',
       'Data Platform Analyst, Subscriptions', 'Healthcare Data Analyst',
       'Junior Data Analyst UK&I', 'Lead Data Analyst (Power BI,SQL)',
       'Officer - Real Time Analytics',
       'ANALISTA GESTAO DE INDICADORES PL', 'DATA ANALYST I',
       'Data Analytics', 'Analista de Dados Júnior | Data Viz',
       'Analyst-Data Science', 'Analyst, Data Science',
       'Data Analyst Intern', 'Analista de Dados Júnior',
       'Sr Data Analyst', 'Data Analyst (Data Visualization)',
       'Analista de Business Intelligence Júnior',
       'Data Associate - Gurgaon',
       'Data Analyst - Local to Pittsburgh or Cleveland',
       'Analista de Análise de Dados Junior', 'Data analyst',
       'Data Intern', 'Jr. Data & BI Analyst',
       'Data Scientist, Product, Sustainability',
       'Data Scientist, Product Analytics', 'Fraud Data Scientist',
       'Senior Data Scientist', 'Data Scientist',
       'Machine Learning Engineer (L5) - Content & Media ML Foundations',
       'Data Scientist - Last Mile',
       'Partner Data Scientist, Growth Partnerships',
       'Jr. Data Scientist', 'Data Scientist, Marketing Science',
       'AI/ML Engineer',
       'Data Scientist- Customer Lifecycle and Engagement',
       'Cientista de Dados II - Área Prevenção a Fraudes',
       'Graduate Data Scientist',
       'Staff Data Scientist, Strategy & Insights', 'Data Scientist I',
       'Data Scientist/Analyst', 'GEN AI/ML',
       'Data Scientist, Fundamental Sector Data',
       'Machine Learning Engineer (Berlin, Germany)',
       'Data Scientist (L5) - App QoE',
       'Data Scientist (Business Operations)',
       'Junior Artificial Intelligence (AI) / Machine Learning (ML) Engineer',
       'Junior Frontend Developer',
       'Data Scientist (Climate & Geospatial)', 'Data Scientist Jr.',
       'Cientista de Dados - Estágio', 'Machine Learning Engineer',
       'Data Scientist (Entry Level)', 'Product Data Scientist',
       'Research And Development Scientist',
       'Data Scientist Senior - MLOps & Transformation (F/H)',
       'Junior Data Scientist', 'Data Scientist-1',
       'Data Scientist Strategy & Value Creation Consulting',
       'Data Scientist (m/f/d)', 'Data Scientist (AI/ML)',
       'Data Scientist/Sr Data Scientist',
       'Machine Learning Engineer (Junior)', 'AI/ML Developer',
       'AI/ML Researcher',
       'Data Scientist, Consumer Research & Marketing',
       'Data Scientist, Marketing', 'AI Engineer',
       'Data Scientist III, Product, Operations Data Science',
       'Machine Learning Software Engineer (L5) - Content and Studio',
       'Data Scientist III (Commercial Analytics)',
       'Data Engineer (L5) - Conversation',
       'Data Engineer (L4) - Security', 'Data Engineer',
       'Data Engineer, Play Data Science and Analytics',
       'Data Engineer, Infrastructure',
       'ML Software Engineer (L4/L5) - Media Algorithms',
       'Analytics Engineer (L4) - Acquisition',
       'Data Engineer, Product Analytics',
       'Data Engineer I (Full Time) United States',
       'Software Engineer L4, Machine Learning Platform (Metaflow)',
       'Software Engineer 5, Data Clean Room', 'Senior Data Engineer',
       'Data Engineer Graduate (Ads Data Application) - 2025 Start (BS/MS)',
       'Senior, Data Engineer',
       'Software Engineer, AI Platform - New Grad',
       'Data Engineer - People Analytics', 'Data Engineer, E-Commerce',
       'Data Engineer, VX Analytics', 'Sr. Data Engineer',
       'Data Engineer III',
       'Data Engineer, Analytics (Technical Leadership)',
       'Remote Engineer, Data, I', 'Sr. Data Engineer, Analytics',
       'Data Engineer Jr.', 'Data Engineer - Subscriptions',
       'Data Engineer, Digital Acceleration', '(USA) Data Engineer III',
       'Data Engineer (University Grad)', 'Data Engineer I, IN-Ads',
       'Data Engineer - Python', 'Data Engineer with Python + SQL',
       'Data Engineer, Marketplace', 'UK 2025 Data Engineer Internship',
       'Infrastructure Partner Data Engineer',
       'Infrastructure Partner Data Engineer, YouTube',
       'Infrastructure Partner Data Engineer, Youtube',
       'Data Operation Engineer I', 'Data Engineer(AWS)',
       'Associate Data Engineer', 'Data Engineer - C10',
       'Data Engineer - Commerce Platform',
       'Data Engineer - Enterprise Data Operations Analyst',
       'Jr. Data Engineer', 'Data Engineer - C11',
       'Python & SQL Data Engineer_Director_Software Engineering',
       'Senior Software Engineer, Systems Infrastructure',
       'Data Analytics Engineer', 'Data Engineer (Platform)',
       'Data Engineer- Python Pyspark', 'Data Engineer with Pyspark',
       'Data Engineer I'], dtype=object)

In [16]:
df_copy['title'].value_counts().head(25)

title
Data Analyst                                            49
Data Engineer                                           27
Data Scientist                                          23
Data Engineer, Product Analytics                        11
Machine Learning Engineer                                9
Data Scientist, Product Analytics                        5
Data Products Analyst, YouTube                           4
Data Analyst I                                           3
Business Data Analyst                                    3
Data Analyst II                                          3
Data Engineer I (Full Time) United States                2
Senior Data Analyst                                      2
Junior Data Analyst                                      2
Data Scientist, Product, Sustainability                  2
Healthcare Data Analyst                                  2
Data Scientist III, Product, Operations Data Science     2
Data Engineer, E-Commerce                                2
Data Engineer III                                        2
Data Scientist I                                         2
Senior Data Scientist                                    2
Data Engineer, Analytics (Technical Leadership)          2
Sr. Data Analyst                                         2
Data Analytics                                           2
Analyst, Data Science, RMBS                              1
Junior Data Analyst - Remote                             1
Name: count, dtype: int64

In [17]:
data_analyst_roles = list(df_copy['title'][df_copy['title'].str.contains('Data Analyst')].unique())

data_analyst_roles_2 = [
    'Data & Analytics, Analyst', 'DATA ANALYST I', 'Data analyst',
    'Analyst, Data Analytics & Intelligence', 'Data Analytics',
    'Analista de Business Intelligence Júnior',
    'Analista de Análise de Dados Junior',
    'Jr. Data & BI Analyst',
    'Data Products Analyst, YouTube',
    'Customer Relationship Management Analyst'
    ]

data_analyst_roles.extend(data_analyst_roles_2)

In [18]:
data_engineer_roles = list(df_copy['title'][df_copy['title'].str.contains('Data Engineer')].unique())

data_engineer_roles_2 = ['Remote Engineer, Data, I', 'Data Operation Engineer I']

data_engineer_roles.extend(data_engineer_roles_2)

In [19]:
data_scientist_roles = list(df_copy['title'][df_copy['title'].str.contains('Data Scientist')].unique())
data_scientist_roles_2 = ['Cientista de Dados II - Área Prevenção a Fraudes', 'Cientista de Dados - Estágio']

data_scientist_roles.extend(data_scientist_roles_2)

In [20]:
machine_learning_engineer_roles = list(df_copy['title'][df_copy['title'].str.contains('Machine Learning Engineer')].unique())

machine_learning_engineer_roles_2 = [
    'AI/ML Engineer', 'Junior Artificial Intelligence (AI) / Machine ...',
    'AI/ML Researcher', 'Machine Learning Software Engineer (L5) - Cont...',
    'ML Software Engineer (L4/L5) - Media Algorithms',
    'Software Engineer L4, Machine Learning Platfor..'
    ]

machine_learning_engineer_roles.extend(machine_learning_engineer_roles_2)

In [21]:
def job_title_short_func(title):
        for role in data_analyst_roles:
            if title.strip() == role:
                return('Data Analyst')
            
        for role in data_engineer_roles:
            if title.strip() == role:
                return('Data Engineer')
        
        for role in data_scientist_roles:
            if title.strip() == role:
                return('Data Scientist')
        
        for role in machine_learning_engineer_roles:
            if title.strip() == role:
                return('Machine Learning Engineer')
        
        else:
            return('Other')

In [22]:
df_copy['job_title_short'] = df_copy['title'].apply(job_title_short_func)

In [23]:
df_copy.sample(20)

,id,title,company,location,source,date_posted,description,job_title_short
53,89,Data Analyst,Ignite Digital Services,"San Diego, CA",LinkedIn,2025-04-10,Are you searching for an opportunity to take y...,Data Analyst
185,449,Machine Learning Engineer (Junior),LogicMatrix,"Florida, United States",LinkedIn,2025-04-17,Machine Learning Engineer (Junior)\n\n\n\nA Bi...,Machine Learning Engineer
179,443,Data Scientist,Sigma Suisse,"Geneva, Switzerland",LinkedIn,2025-04-16,"Sigma Suisse is seeking for it's client, a com...",Data Scientist
45,81,Data Analyst - 100% Remote,Lensa,"Jacksonville, FL",LinkedIn,2025-04-16,Lensa is the leading career site for job seeke...,Data Analyst
104,242,Analista de Análise de Dados Junior,C6 Bank,"São Paulo, São Paulo, Brazil",LinkedIn,2025-04-15,Nossa área de análise de dados\n\nO time de an...,Data Analyst
80,130,Data Analytics,EY,"Gurugram, Haryana, India",LinkedIn,2025-04-15,"At EY, you’ll have the chance to build a caree...",Data Analyst
146,407,GEN AI/ML,technology,"Bengaluru, Karnataka, India",LinkedIn,2025-04-16,"At Nielsen, we are passionate about our work t...",Other
33,69,Data Analyst I,Colibri Group,United States,LinkedIn,2025-04-11,"At Colibri, culture is a critical part of our ...",Data Analyst
109,286,Data Analyst,Redwood Materials,"San Francisco, CA",LinkedIn,2025-04-16,About Redwood Materials\n\nRedwood Materials w...,Data Analyst
231,586,Analytics Engineer (L4) - Acquisition,Netflix,"Los Gatos, CA",LinkedIn,2025-04-16,Netflix is one of the world's leading entertai...,Other
90,142,Data Analyst,AARATECH,"California, United States",LinkedIn,2025-04-16,Overview:\n\nThe Data Analyst is tasked with c...,Data Analyst
17,35,"Data Analyst - SQL, ERP",CyberCoders,"Yakima, WA",LinkedIn,2025-04-15,Data Analyst\n\nLocation: Remote\n\nPosition O...,Data Analyst
307,671,Data Engineer,Samba TV,"Amsterdam, North Holland, Netherlands",LinkedIn,2025-04-15,Samba TV tracks streaming and broadcast video ...,Data Engineer
129,390,Jr. Data Scientist,Matlen Silver,United States,LinkedIn,2025-04-16,Title: Junior Data Scientist\n\nContract Durat...,Data Scientist
13,30,Data Analyst,FinThrive,United States,LinkedIn,2025-04-15,About the Role\n\nImpact you will make\n\nAs a...,Data Analyst
261,616,"Data Engineer, Product Analytics",Meta,United States,LinkedIn,2025-04-14,"As a Data Engineer at Meta, you will shape the...",Data Engineer
47,83,Data Analyst,AARATECH,New York City Metropolitan Area,LinkedIn,2025-04-14,Overview:\n\nThe Data Analyst is tasked with c...,Data Analyst
93,145,Data Analyst,Searchability®,"Nottingham, England, United Kingdom",LinkedIn,2025-04-16,Data Analyst – 12 MONTH FTC\n\n\n\n\nOpportuni...,Data Analyst
46,82,Data Analyst,Equiliem,"Lexington, MA",LinkedIn,2025-04-16,MUST HAVE SECRET CLEARANCE OR BE ABLE TO OBTAI...,Data Analyst
184,448,Data Scientist/Sr Data Scientist,American Airlines,"Dallas, TX",LinkedIn,2025-04-15,Intro\n\nAre you ready to explore a world of p...,Data Scientist

In [24]:
df_copy['job_title_short'].value_counts()

job_title_short
Data Analyst                 97
Data Engineer                84
Data Scientist               64
Other                        28
Machine Learning Engineer    15
Name: count, dtype: int64

**5. Import The Exported Excel Files Containing The New Columns as Separate Dataframes, Which are Then Merged With The Main Dataframe.:**

**(1) Import The Exported Excel Files:**

In [25]:
skills_dfs_list = []
index = 1

while index < 5:
    df_skills = pd.read_excel(
        f'D:\\IT Courses\\Finished Courses\\LinkedIn Job Market Analysis Project\\LinkedIn_Data_Job_Market_Analysis_Project\\Dataset\\extract_columns_from_description_{index}.xlsx',
        usecols=['id', 'skills', 'work_type', 'educational_background', 'experience_years']
    )
    skills_dfs_list.append(df_skills)
    index += 1

In [26]:
skills_df = skills_dfs_list[0]

for skill_df in skills_dfs_list[1:]:
    skills_df = pd.concat(
        [
        skills_df,
        skill_df
        ]
    )

In [27]:
skills_df['skills'] = skills_df['skills'].str.strip()

In [28]:
skills_df

,id,skills,work_type,educational_background,experience_years
0,1,"['Tableau', 'Python', 'SQL', 'R', 'Machine Lea...",NaN,True,4+
1,2,"['Tableau', 'Python', 'SQL', 'R', 'Machine Lea...",NaN,True,4+
2,3,"['Tableau', 'Python', 'SQL', 'R', 'Machine Lea...",NaN,True,4+
3,4,"['Tableau', 'Python', 'SQL', 'R', 'Machine Lea...",NaN,True,4+
4,5,"['Python', 'SQL']",NaN,True,4+
...,...,...,...,...,...
50,691,"['Python', 'SQL', 'Kafka', 'Airflow', 'AWS', '...",NaN,False,7+
51,692,"['SQL', 'Spark', 'AWS', 'ETL']",NaN,False,14+
52,693,"['Python', 'R', 'SQL', 'NoSQL', 'Power BI', 'D...",remote,True,NaN
53,740,"['Python', 'SQL', 'Redshift', 'MySQL', 'ETL', ...",NaN,True,3+
54,741,"['Python', 'SQL', 'Spark', 'Hadoop', 'Airflow'...",NaN,True,1+

**(2) Merge (Join) Skills Dataframe With Main Dataframe By Column "Id"::**

In [29]:
df_copy = pd.merge(
        df_copy,
        skills_df,
        how='inner',
        on='id'
)

In [30]:
df_copy

,id,title,company,location,source,date_posted,description,job_title_short,skills,work_type,educational_background,experience_years
0,1,Data Analyst,Meta,"New York, NY",LinkedIn,2025-04-14,The Social Measurement team is a growing team ...,Data Analyst,"['Tableau', 'Python', 'SQL', 'R', 'Machine Lea...",NaN,True,4+
1,2,Data Analyst,Meta,"San Francisco, CA",LinkedIn,2025-04-14,The Social Measurement team is a growing team ...,Data Analyst,"['Tableau', 'Python', 'SQL', 'R', 'Machine Lea...",NaN,True,4+
2,3,Data Analyst,Meta,"Los Angeles, CA",LinkedIn,2025-04-14,The Social Measurement team is a growing team ...,Data Analyst,"['Tableau', 'Python', 'SQL', 'R', 'Machine Lea...",NaN,True,4+
3,4,Data Analyst,Meta,"Washington, DC",LinkedIn,2025-04-14,The Social Measurement team is a growing team ...,Data Analyst,"['Tableau', 'Python', 'SQL', 'R', 'Machine Lea...",NaN,True,4+
4,5,Data Analyst II,Pinterest,"Chicago, IL",LinkedIn,2025-04-16,About Pinterest\n\nMillions of people around t...,Data Analyst,"['Python', 'SQL']",NaN,True,4+
...,...,...,...,...,...,...,...,...,...,...,...,...
283,691,Data Engineer- Python Pyspark,Virtusa,"Chennai, Tamil Nadu, India",LinkedIn,2025-04-10,Senior Data Engineer\n\nPosition Summary\n\nTh...,Data Engineer,"['Python', 'SQL', 'Kafka', 'Airflow', 'AWS', '...",NaN,False,7+
284,692,Data Engineer with Pyspark,Cognizant,"Bangalore Urban, Karnataka, India",LinkedIn,2025-04-13,Job Title:- Data Engineer with Pyspark\n\nLoca...,Data Engineer,"['SQL', 'Spark', 'AWS', 'ETL']",NaN,False,14+
285,693,Data Engineer,Mercedes-Benz Malaysia,"Puchong, Selangor, Malaysia",LinkedIn,2025-04-16,"About Us\n\n\n\n\nAt Mercedes-Benz, we don’t j...",Data Engineer,"['Python', 'R', 'SQL', 'NoSQL', 'Power BI', 'D...",remote,True,NaN
286,740,Data Engineer I,IntePros,"Seattle, WA",LinkedIn,2025-04-15,Data Engineer I – Infrastructure & Automation ...,Data Engineer,"['Python', 'SQL', 'Redshift', 'MySQL', 'ETL', ...",NaN,True,3+
287,741,Data Engineer,Snap Inc.,"Bellevue, WA",LinkedIn,2025-04-16,Snap Inc is a technology company. We believe t...,Data Engineer,"['Python', 'SQL', 'Spark', 'Hadoop', 'Airflow'...",NaN,True,1+

**7. Remove Column "description":**

In [31]:
df_copy = df_copy.drop(
    ['description'],
    axis=1
)

**8. Create Column "country" From "location":**

In [32]:
location_unique = list(df_copy['location'].unique())
len(location_unique)

119

In [33]:
usa_state_abbreviations = "United States|united states|USA|usa|AL|AK|AZ|AR|CA|CO|CT|DE|FL|GA|HI|ID|IL|IN|IA|KS|KY|LA|ME|MD|MA|MI|MN|MS|MO|MT|NE|NV|NH|NJ|NM|NY|NC|ND|OH|OK|OR|PA|RI|SC|SD|TN|TX|UT|VT|VA|WA|WV|WI|WY|New York City Metropolitan Area|Washington DC-Baltimore Area|California|San Francisco Bay Area|Greater Minneapolis-St. Paul Area|DC"

usa_list = list(df_copy['location'][df_copy['location'].str.contains(usa_state_abbreviations)].unique())
len(usa_list)

53

In [34]:
india_list = list(df_copy['location'][df_copy['location'].str.contains('India')].unique())
len(india_list)

12

In [35]:
uk_list = list(df_copy['location'][df_copy['location'].str.contains('United Kingdom')].unique())
len(uk_list)

11

In [36]:
brazil_list = list(df_copy['location'][df_copy['location'].str.contains('Brazil|Greater Rio de Janeiro')].unique())
len(brazil_list)

6

In [37]:
spain_list = list(df_copy['location'][df_copy['location'].str.contains('Spain')].unique())
len(spain_list)

3

In [38]:
canda_list = list(df_copy['location'][df_copy['location'].str.contains('Canada')].unique())
len(canda_list)

3

In [39]:
indonesia_list = list(df_copy['location'][df_copy['location'].str.contains('Indonesia')].unique())
len(indonesia_list)

3

In [ ]:
ireland_list = list(df_copy['location'][df_copy['location'].str.contains('Ireland')].unique())
len(ireland_list)

2

In [41]:
egypt_list = list(df_copy['location'][df_copy['location'].str.contains('Egypt')].unique())
len(egypt_list)

1

In [ ]:
def country_column_func(location_column):
    for item in usa_list:
        if location_column.strip() == item:
            return('United States')
    
    for item in india_list:
        if location_column.strip() == item:
            return('India')

    for item in uk_list:
        if location_column.strip() == item:
            return('United Kingdom')

    for item in brazil_list:
        if location_column.strip() == item:
            return('Brazil')

    for item in spain_list:
        if location_column.strip() == item:
            return('Spain')   

    for item in canda_list:
        if location_column.strip() == item:
            return('Canada') 

    for item in spain_list:
        if location_column.strip() == item:
            return('Spain') 

    for item in indonesia_list:
        if location_column.strip() == item:
            return('Indonesia') 
        
    for item in ireland_list:
        if location_column.strip() == item:
            return('Ireland') 
        
    for item in egypt_list:
        if location_column.strip() == item:
            return('Egypt') 
        
    else:
        return('Other')

In [43]:
df_copy['country'] = df_copy['location'].apply(country_column_func)

In [44]:
df_copy

,id,title,company,location,source,date_posted,job_title_short,skills,work_type,educational_background,experience_years,country
0,1,Data Analyst,Meta,"New York, NY",LinkedIn,2025-04-14,Data Analyst,"['Tableau', 'Python', 'SQL', 'R', 'Machine Lea...",NaN,True,4+,United States
1,2,Data Analyst,Meta,"San Francisco, CA",LinkedIn,2025-04-14,Data Analyst,"['Tableau', 'Python', 'SQL', 'R', 'Machine Lea...",NaN,True,4+,United States
2,3,Data Analyst,Meta,"Los Angeles, CA",LinkedIn,2025-04-14,Data Analyst,"['Tableau', 'Python', 'SQL', 'R', 'Machine Lea...",NaN,True,4+,United States
3,4,Data Analyst,Meta,"Washington, DC",LinkedIn,2025-04-14,Data Analyst,"['Tableau', 'Python', 'SQL', 'R', 'Machine Lea...",NaN,True,4+,United States
4,5,Data Analyst II,Pinterest,"Chicago, IL",LinkedIn,2025-04-16,Data Analyst,"['Python', 'SQL']",NaN,True,4+,United States
...,...,...,...,...,...,...,...,...,...,...,...,...
283,691,Data Engineer- Python Pyspark,Virtusa,"Chennai, Tamil Nadu, India",LinkedIn,2025-04-10,Data Engineer,"['Python', 'SQL', 'Kafka', 'Airflow', 'AWS', '...",NaN,False,7+,India
284,692,Data Engineer with Pyspark,Cognizant,"Bangalore Urban, Karnataka, India",LinkedIn,2025-04-13,Data Engineer,"['SQL', 'Spark', 'AWS', 'ETL']",NaN,False,14+,India
285,693,Data Engineer,Mercedes-Benz Malaysia,"Puchong, Selangor, Malaysia",LinkedIn,2025-04-16,Data Engineer,"['Python', 'R', 'SQL', 'NoSQL', 'Power BI', 'D...",remote,True,NaN,Other
286,740,Data Engineer I,IntePros,"Seattle, WA",LinkedIn,2025-04-15,Data Engineer,"['Python', 'SQL', 'Redshift', 'MySQL', 'ETL', ...",NaN,True,3+,United States
287,741,Data Engineer,Snap Inc.,"Bellevue, WA",LinkedIn,2025-04-16,Data Engineer,"['Python', 'SQL', 'Spark', 'Hadoop', 'Airflow'...",NaN,True,1+,United States

In [45]:
df_copy['country'].value_counts()

country
United States     169
India              41
Other              28
United Kingdom     23
Brazil             10
Canada              5
Ireland             4
Spain               3
Indonesia           3
Egypt               2
Name: count, dtype: int64

**9. Export First Final Dataframe As CSV File For Data Visualization And Insights With Power BI:**

In [46]:
df_copy.to_csv('final_cleaned_data_job_dataset.csv')

**10. Export Second Final Dataframe Which Contain Explode Skills List For Job Market Skills Analysis:**

In [47]:
df_explode = df_copy.copy()

In [48]:
def explode_list(string_list):
    if isinstance(string_list, list):
        return(string_list)
    
    if string_list == '[]':
        return []
    
    else:
        return(ast.literal_eval(string_list))

In [49]:
df_explode['skills'] = df_explode['skills'].apply(explode_list)

In [50]:
df_explode = df_explode.explode('skills')

In [51]:
df_explode.reset_index(inplace=True, drop=True)

In [52]:
df_explode.to_csv('data_job_market_skills_explode_dataset.csv')